mikeakohn/naken_asm/include/8051/stc12c54xx.inc
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;
;; STC12C54xx/STC12C56xx include
;; part of the naken_asm assembler
;;
;; Generated by: Cjacker Huang (cjacker@gmail.com)
;;         Date: 2022-05-21
;;        Parts: STC12C54xx / STC12C56xx
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

WDT_CONTR equ 0xe1
ISP_DATA equ 0xe2
ISP_ADDRH equ 0xe3
ISP_ADDRL equ 0xe4
ISP_CMD equ 0xe5
ISP_TRIG equ 0xe6
ISP_CONTR equ 0xe7
CLK_DIV equ 0xc7
P0M0 equ 0x93
P0M1 equ 0x94
P1M0 equ 0x91
P1M1 equ 0x92
P2M0 equ 0x95
P2M1 equ 0x96
P3M0 equ 0xb1
P3M1 equ 0xb2
SPSTAT equ 0x84
SPCTL equ 0x85
SPDAT equ 0x86
ADC_CONTR equ 0xc5
ADC_DATA equ 0xc6
ADC_LOW2 equ 0xbe
CCON equ 0xD8
CMOD equ 0xD9
CCAPM0 equ 0xDA
CCAPM1 equ 0xDB
CCAPM2 equ 0xDC
CCAPM3 equ 0xDD
CCAPM4 equ 0xDE
CCAPM5 equ 0xDF
CL equ 0xE9
CCAP0L equ 0xEA
CCAP1L equ 0xEB
CCAP2L equ 0xEC
CCAP3L equ 0xED
CCAP4L equ 0xEE
CCAP5L equ 0xEF
CH equ 0xF9
CCAP0H equ 0xFA
CCAP1H equ 0xFB
CCAP2H equ 0xFC
CCAP3H equ 0xFD
CCAP4H equ 0xFE
CCAP5H equ 0xFF
PCA_PWM0 equ 0xF2
PCA_PWM1 equ 0xF3
PCA_PWM2 equ 0xF4
PCA_PWM3 equ 0xF5
PCA_PWM4 equ 0xF6
PCA_PWM5 equ 0xF7
SADDR equ 0xA9
IPH equ 0xB7
SADEN equ 0xB9
T2CON equ 0xC8
T2MOD equ 0xC9
RCAP2L equ 0xCA
RCAP2H equ 0xCB
TL2 equ 0xCC
TH2 equ 0xCD

; xdata

